package a1_java;

public class a3_Operations {

    public static void main(String[] args) {

        /*
                '='        - присвоение
                '+ - * /'  - если мы делим целые числа, результат тоже будет целое число
                '%'        - остаток от делениия
                '>  >=  ==  !='  - операторы сравнения (приоритет меньше математических операций)
                'i++  i--  ++i   --i' - декремент, инкремент
                '|| &&'  логические операции
                '!' - оперция отрицания
                'Math.pow(a,3) ' - операции класса Math
                '+= -= *= /='  - Присовение со сложением a+=5;
         */

    }
}
